#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
module.registry.module.jwt.random_password.secret: Refreshing state... [id=none]
module.registry.null_resource.apigateway_create_deployment: Refreshing state... [id=1870206316084463404]
data.dns_a_record_set.home: Reading...
data.dns_a_record_set.home: Read complete after 0s [id=capnduck.ddns.net]
module.acm.data.aws_route53_zone.this: Reading...
module.acm.data.aws_route53_zone.this: Read complete after 1s [id=Z05346383CF9J3IH2UIOG]
module.registry.module.registry.module.disco.aws_api_gateway_method_response.well_known_terraform_GET_200: Refreshing state... [id=agmr-5woxtrwobi-jhkbsu-GET-200]
module.registry.module.registry.aws_iam_role_policy.auth[0]: Refreshing state... [id=registry-prod-authorizer:terraform-20240409190256564400000003]
module.registry.module.jwt.aws_secretsmanager_secret.secret: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:009727205366:secret:capnduck.com-prod-gGA6eW]
aws_acm_certificate_validation.certificate: Refreshing state... [id=2024-04-09 18:58:26.826 +0000 UTC]
module.registry.module.registry.module.disco.aws_api_gateway_method.well_known_terraform_GET: Refreshing state... [id=agm-5woxtrwobi-jhkbsu-GET]
module.registry.module.registry.aws_api_gateway_base_path_mapping.main[0]: Refreshing state... [id=registry.capnduck.com/]
module.registry.module.registry.module.modules_v1.aws_api_gateway_integration_response.versions_GET_200: Refreshing state... [id=agir-5woxtrwobi-mietgk-GET-200]
module.registry.module.store.aws_s3_bucket_acl.bucket: Refreshing state... [id=capnduck.com-terraform-registry,private]
aws_route53_record.registry: Refreshing state... [id=Z05346383CF9J3IH2UIOG_registry.capnduck.com._A]
module.registry.module.store.aws_dynamodb_table.modules: Refreshing state... [id=capnduck.com-terraform-registry]
module.registry.module.registry.module.modules_v1.aws_api_gateway_integration_response.download_GET_200: Refreshing state... [id=agir-5woxtrwobi-d5bynn-GET-200]
module.registry.module.registry.aws_iam_role_policy.modules: Refreshing state... [id=registry-prod-modules:terraform-20240409190256613100000004]
module.registry.module.registry.module.modules_v1.aws_api_gateway_method_response.download_GET_200: Refreshing state... [id=agmr-5woxtrwobi-d5bynn-GET-200]
module.registry.module.registry.aws_api_gateway_deployment.live: Refreshing state... [id=5qtc3a]
module.registry.module.registry.aws_iam_role.auth[0]: Refreshing state... [id=registry-prod-authorizer]
module.registry.module.store.aws_s3_bucket.bucket: Refreshing state... [id=capnduck.com-terraform-registry]
module.registry.module.authorizer.aws_lambda_function.authorizer: Refreshing state... [id=registry-prod-authorizer]
module.registry.module.registry.module.modules_v1.aws_api_gateway_resource.module: Refreshing state... [id=nevl7e]
module.registry.module.registry.module.modules_v1.aws_api_gateway_method.download_GET: Refreshing state... [id=agm-5woxtrwobi-d5bynn-GET]
module.registry.module.registry.module.modules_v1.aws_api_gateway_resource.modules_root: Refreshing state... [id=ol48ui]
module.registry.module.registry.module.modules_v1.aws_api_gateway_resource.download: Refreshing state... [id=d5bynn]
module.registry.module.registry.module.modules_v1.aws_api_gateway_resource.versions: Refreshing state... [id=mietgk]
module.registry.module.registry.module.modules_v1.aws_api_gateway_resource.provider: Refreshing state... [id=ezpxbi]
module.registry.module.registry.module.disco.aws_api_gateway_integration.well_known_terraform_GET: Refreshing state... [id=agi-5woxtrwobi-jhkbsu-GET]
module.registry.module.registry.aws_iam_role.modules: Refreshing state... [id=registry-prod-modules]
module.registry.module.registry.aws_api_gateway_rest_api.root: Refreshing state... [id=5woxtrwobi]
module.registry.module.registry.module.disco.aws_api_gateway_resource.well_known_terraform: Refreshing state... [id=jhkbsu]
module.registry.module.registry.module.modules_v1.aws_api_gateway_integration.download_GET: Refreshing state... [id=agi-5woxtrwobi-d5bynn-GET]
module.registry.module.registry.module.disco.aws_api_gateway_resource.well_known: Refreshing state... [id=h3di0d]
module.registry.module.authorizer.aws_iam_role.authorizer: Refreshing state... [id=lambda-lambdaRole-waf]
aws_acm_certificate.certificate: Refreshing state... [id=arn:aws:acm:us-west-2:009727205366:certificate/3317431d-4b19-4c60-b137-af91a43c9540]
module.registry.module.registry.module.modules_v1.aws_api_gateway_method_response.versions_GET_200: Refreshing state... [id=agmr-5woxtrwobi-mietgk-GET-200]
module.registry.module.registry.aws_api_gateway_authorizer.main[0]: Refreshing state... [id=bwi832]
module.registry.module.registry.module.modules_v1.aws_api_gateway_method.versions_GET: Refreshing state... [id=agm-5woxtrwobi-mietgk-GET]
module.registry.module.store.aws_s3_bucket_versioning.bucket: Refreshing state... [id=capnduck.com-terraform-registry]
module.registry.module.registry.module.modules_v1.aws_api_gateway_resource.namespace: Refreshing state... [id=t0vetm]
aws_route53_record.certificate: Refreshing state... [id=Z05346383CF9J3IH2UIOG__49cddf3e08227b7fdc3e5960deb9394c.registry.capnduck.com._CNAME]
module.registry.module.registry.module.disco.aws_api_gateway_integration_response.well_known_terraform_GET_200: Refreshing state... [id=agir-5woxtrwobi-jhkbsu-GET-200]
module.registry.module.registry.module.modules_v1.aws_api_gateway_resource.version: Refreshing state... [id=6n7ozm]
module.registry.module.jwt.aws_secretsmanager_secret_version.secret: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:009727205366:secret:capnduck.com-prod-gGA6eW|terraform-20240409190243391200000002]
module.registry.module.registry.module.modules_v1.aws_api_gateway_integration.versions_GET: Refreshing state... [id=agi-5woxtrwobi-mietgk-GET]
module.registry.module.store.aws_s3_bucket_ownership_controls.bucket: Refreshing state... [id=capnduck.com-terraform-registry]
module.registry.module.registry.aws_api_gateway_domain_name.main[0]: Refreshing state... [id=registry.capnduck.com]
module.capnduck_records.data.aws_route53_zone.this[0]: Reading...
module.jelliott_records.data.aws_route53_zone.this[0]: Reading...
module.all_from_home.data.aws_vpc.this: Reading...
data.aws_vpc.this: Reading...
data.aws_caller_identity.this: Reading...
data.aws_route53_zone.this[0]: Reading...
module.http_https_everywhere.data.aws_vpc.this: Reading...
module.capnduck_records.data.aws_route53_zone.this[0]: Read complete after 1s [id=Z05346383CF9J3IH2UIOG]
data.aws_caller_identity.this: Read complete after 0s [id=009727205366]
data.aws_route53_zone.this[0]: Read complete after 0s [id=Z05346383CF9J3IH2UIOG]
aws_route53_zone.capnduck_com: Preparing import... [id=Z05346383CF9J3IH2UIOG]
aws_route53_zone.capnduck_com: Refreshing state... [id=Z05346383CF9J3IH2UIOG]
module.jelliott_records.data.aws_route53_zone.this[0]: Read complete after 1s [id=Z04938253L3MEH8G7WE6R]
module.http_https_everywhere.data.aws_vpc.this: Read complete after 1s [id=vpc-09289eb9291b2949c]
data.aws_vpc.this: Read complete after 1s [id=vpc-09289eb9291b2949c]
data.aws_subnets.private: Reading...
data.aws_subnets.public: Reading...
module.all_from_home.data.aws_vpc.this: Read complete after 1s [id=vpc-09289eb9291b2949c]
data.aws_subnets.public: Read complete after 0s [id=us-west-2]
data.aws_subnets.private: Read complete after 0s [id=us-west-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # aws_acm_certificate.certificate will be destroyed
  # (because aws_acm_certificate.certificate is not in configuration)
  - resource "aws_acm_certificate" "certificate" {
      - arn                       = "arn:aws:acm:us-west-2:009727205366:certificate/3317431d-4b19-4c60-b137-af91a43c9540" -> null
      - domain_name               = "registry.capnduck.com" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "registry.capnduck.com"
              - resource_record_name  = "_49cddf3e08227b7fdc3e5960deb9394c.registry.capnduck.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_3fc4190265f4e96e6bcd442506e1e9e4.mhbtsbpdnt.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-west-2:009727205366:certificate/3317431d-4b19-4c60-b137-af91a43c9540" -> null
      - key_algorithm             = "RSA_2048" -> null
      - not_after                 = "2025-05-08T23:59:59Z" -> null
      - not_before                = "2024-04-09T00:00:00Z" -> null
      - pending_renewal           = false -> null
      - renewal_eligibility       = "ELIGIBLE" -> null
      - renewal_summary           = [] -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "registry.capnduck.com",
        ] -> null
      - tags                      = {} -> null
      - tags_all                  = {} -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_acm_certificate_validation.certificate will be destroyed
  # (because aws_acm_certificate_validation.certificate is not in configuration)
  - resource "aws_acm_certificate_validation" "certificate" {
      - certificate_arn         = "arn:aws:acm:us-west-2:009727205366:certificate/3317431d-4b19-4c60-b137-af91a43c9540" -> null
      - id                      = "2024-04-09 18:58:26.826 +0000 UTC" -> null
      - validation_record_fqdns = [
          - "_49cddf3e08227b7fdc3e5960deb9394c.registry.capnduck.com",
        ] -> null
    }

  # aws_db_subnet_group.private will be created
  + resource "aws_db_subnet_group" "private" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "private"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-0253184dc60aaf031",
          + "subnet-04a38528da1dcb2ed",
          + "subnet-06947ef14298c9e67",
          + "subnet-06f85801b091e2759",
          + "subnet-0c035011e361ea452",
          + "subnet-0f6f3efb89a553c06",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "type" = "private"
        }
      + tags_all                = {
          + "Name"        = "infra"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
          + "type"        = "private"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_db_subnet_group.public will be created
  + resource "aws_db_subnet_group" "public" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "public"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-0a284c52e2f9146f9",
          + "subnet-0a5bc5ec073940dca",
          + "subnet-0b94d7faf68936e3c",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "type" = "public"
        }
      + tags_all                = {
          + "Name"        = "infra"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
          + "type"        = "public"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_dynamodb_table.tfstate_lock will be created
  + resource "aws_dynamodb_table" "tfstate_lock" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "terraform-tfstate-lock"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = {
          + "Name"        = "infra"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + write_capacity   = 1

      + attribute {
          + name = "LockID"
          + type = "S"
        }
    }

  # aws_ecr_lifecycle_policy.this will be created
  + resource "aws_ecr_lifecycle_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "keep last 5 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber = 5
                          + countType   = "imageCountMoreThan"
                          + tagStatus   = "any"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "capnduck"
    }

  # aws_ecr_repository.this will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "IMMUTABLE"
      + name                 = "capnduck"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Name"        = "infra"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }

      + encryption_configuration {
          + encryption_type = "KMS"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_iam_service_linked_role.spot will be created
  + resource "aws_iam_service_linked_role" "spot" {
      + arn              = (known after apply)
      + aws_service_name = "spot.amazonaws.com"
      + create_date      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + path             = (known after apply)
      + tags_all         = {
          + "Name"        = "infra"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + unique_id        = (known after apply)
    }

  # aws_key_pair.this will be created
  + resource "aws_key_pair" "this" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "ec2-key-ssh"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags_all        = {
          + "Name"        = "infra"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
    }

  # aws_kms_alias.capnduck_com will be created
  + resource "aws_kms_alias" "capnduck_com" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/capnduck-ds-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_alias.tfstate will be created
  + resource "aws_kms_alias" "tfstate" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/tfstate"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.capnduck_com will be created
  + resource "aws_kms_key" "capnduck_com" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "ECC_NIST_P256"
      + deletion_window_in_days            = 7
      + description                        = "Key for capnduck.com."
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "SIGN_VERIFY"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "kms:DescribeKey",
                          + "kms:GetPublicKey",
                          + "kms:Sign",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dnssec-route53.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow Route 53 DNSSEC Service"
                    },
                  + {
                      + Action    = "kms:CreateGrant"
                      + Condition = {
                          + Bool = {
                              + "kms:GrantIsForAWSResource" = "true"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dnssec-route53.amazonaws.com"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow Route 53 DNSSEC Service to CreateGrant"
                    },
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "IAM User Permissions"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + tags_all                           = (known after apply)
    }

  # aws_kms_key.tfstate will be created
  + resource "aws_kms_key" "tfstate" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = (known after apply)
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "Name"        = "infra"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
    }

  # aws_route53_hosted_zone_dnssec.capnduck_com will be created
  + resource "aws_route53_hosted_zone_dnssec" "capnduck_com" {
      + hosted_zone_id = "Z05346383CF9J3IH2UIOG"
      + id             = (known after apply)
      + signing_status = "SIGNING"
    }

  # aws_route53_key_signing_key.capnduck_com will be created
  + resource "aws_route53_key_signing_key" "capnduck_com" {
      + digest_algorithm_mnemonic  = (known after apply)
      + digest_algorithm_type      = (known after apply)
      + digest_value               = (known after apply)
      + dnskey_record              = (known after apply)
      + ds_record                  = (known after apply)
      + flag                       = (known after apply)
      + hosted_zone_id             = "Z05346383CF9J3IH2UIOG"
      + id                         = (known after apply)
      + key_management_service_arn = (known after apply)
      + key_tag                    = (known after apply)
      + name                       = "capnduck.com."
      + public_key                 = (known after apply)
      + signing_algorithm_mnemonic = (known after apply)
      + signing_algorithm_type     = (known after apply)
      + status                     = "ACTIVE"
    }

  # aws_route53_record.certificate will be destroyed
  # (because aws_route53_record.certificate is not in configuration)
  - resource "aws_route53_record" "certificate" {
      - allow_overwrite                  = true -> null
      - fqdn                             = "_49cddf3e08227b7fdc3e5960deb9394c.registry.capnduck.com" -> null
      - id                               = "Z05346383CF9J3IH2UIOG__49cddf3e08227b7fdc3e5960deb9394c.registry.capnduck.com._CNAME" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "_49cddf3e08227b7fdc3e5960deb9394c.registry.capnduck.com" -> null
      - records                          = [
          - "_3fc4190265f4e96e6bcd442506e1e9e4.mhbtsbpdnt.acm-validations.aws.",
        ] -> null
      - ttl                              = 60 -> null
      - type                             = "CNAME" -> null
      - zone_id                          = "Z05346383CF9J3IH2UIOG" -> null
    }

  # aws_route53_record.registry will be destroyed
  # (because aws_route53_record.registry is not in configuration)
  - resource "aws_route53_record" "registry" {
      - fqdn                             = "registry.capnduck.com" -> null
      - id                               = "Z05346383CF9J3IH2UIOG_registry.capnduck.com._A" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "registry.capnduck.com" -> null
      - records                          = [] -> null
      - ttl                              = 0 -> null
      - type                             = "A" -> null
      - zone_id                          = "Z05346383CF9J3IH2UIOG" -> null

      - alias {
          - evaluate_target_health = true -> null
          - name                   = "d-1gmcfibcx0.execute-api.us-west-2.amazonaws.com" -> null
          - zone_id                = "Z2OJLYMUO9EFXC" -> null
        }
    }

  # aws_route53_zone.capnduck_com will be updated in-place
  # (imported from "Z05346383CF9J3IH2UIOG")
  ~ resource "aws_route53_zone" "capnduck_com" {
        arn                 = "arn:aws:route53:::hostedzone/Z05346383CF9J3IH2UIOG"
        comment             = "Managed by Terraform"
      + force_destroy       = true
        id                  = "Z05346383CF9J3IH2UIOG"
        name                = "capnduck.com"
        name_servers        = [
            "ns-1348.awsdns-40.org",
            "ns-157.awsdns-19.com",
            "ns-1705.awsdns-21.co.uk",
            "ns-755.awsdns-30.net",
        ]
        primary_name_server = "ns-157.awsdns-19.com"
        tags                = {
            "Name" = "capnduck.com."
        }
        tags_all            = {
            "Name"        = "capnduck.com."
            "environment" = "prod"
            "owner"       = "aws@capnduck.com"
            "project"     = "infrastructure"
            "terraform"   = "true"
        }
        zone_id             = "Z05346383CF9J3IH2UIOG"
    }

  # aws_s3_bucket.tfstate will be created
  + resource "aws_s3_bucket" "tfstate" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "capnduck-terraform-tfstate"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = {
          + "Name"        = "infra"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_acl.tfstate will be created
  + resource "aws_s3_bucket_acl" "tfstate" {
      + acl    = "private"
      + bucket = (known after apply)
      + id     = (known after apply)
    }

  # aws_s3_bucket_public_access_block.tfstate will be created
  + resource "aws_s3_bucket_public_access_block" "tfstate" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.tfstate will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "tfstate" {
      + bucket = "capnduck-terraform-tfstate"
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.tfstate will be created
  + resource "aws_s3_bucket_versioning" "tfstate" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_secretsmanager_secret.this will be created
  + resource "aws_secretsmanager_secret" "this" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "ec2-key-ssh"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = {
          + "Name"        = "infra"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
    }

  # aws_secretsmanager_secret_version.this will be created
  + resource "aws_secretsmanager_secret_version" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # tls_private_key.this will be created
  + resource "tls_private_key" "this" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 8192
    }

  # module.acm.aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "capnduck.com"
      + domain_validation_options = [
          + {
              + domain_name           = "capnduck.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "www.capnduck.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "capnduck.com",
          + "www.capnduck.com",
        ]
      + tags                      = {
          + "module"    = "https://github.com/CapnDucks/aws_acm.git"
          + "terraform" = "true"
        }
      + tags_all                  = {
          + "module"    = "https://github.com/CapnDucks/aws_acm.git"
          + "terraform" = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.acm.aws_route53_record.validation[0] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z05346383CF9J3IH2UIOG"
    }

  # module.acm.aws_route53_record.validation[1] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z05346383CF9J3IH2UIOG"
    }

  # module.all_from_home.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "all from home group managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "all from home"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Name"        = "infra"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id                 = "vpc-09289eb9291b2949c"
    }

  # module.all_from_home.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All egress traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.all_from_home.aws_security_group_rule.tcp[0] will be created
  + resource "aws_security_group_rule" "tcp" {
      + cidr_blocks              = [
          + "207.224.118.130/32",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.all_from_home.aws_security_group_rule.tcp[1] will be created
  + resource "aws_security_group_rule" "tcp" {
      + cidr_blocks              = [
          + "207.224.118.130/32",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.all_from_home.aws_security_group_rule.tcp[2] will be created
  + resource "aws_security_group_rule" "tcp" {
      + cidr_blocks              = [
          + "207.224.118.130/32",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.all_from_home.aws_security_group_rule.tcp[3] will be created
  + resource "aws_security_group_rule" "tcp" {
      + cidr_blocks              = [
          + "207.224.118.130/32",
        ]
      + from_port                = 3306
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 3306
      + type                     = "ingress"
    }

  # module.all_from_home.aws_security_group_rule.tcp[4] will be created
  + resource "aws_security_group_rule" "tcp" {
      + cidr_blocks              = [
          + "207.224.118.130/32",
        ]
      + from_port                = 5201
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5201
      + type                     = "ingress"
    }

  # module.all_from_home.aws_security_group_rule.tcp[5] will be created
  + resource "aws_security_group_rule" "tcp" {
      + cidr_blocks              = [
          + "207.224.118.130/32",
        ]
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.all_from_home.aws_security_group_rule.tcp[6] will be created
  + resource "aws_security_group_rule" "tcp" {
      + cidr_blocks              = [
          + "207.224.118.130/32",
        ]
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.all_from_home.aws_security_group_rule.tcp[7] will be created
  + resource "aws_security_group_rule" "tcp" {
      + cidr_blocks              = [
          + "207.224.118.130/32",
        ]
      + from_port                = 8443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.ecs.aws_ecs_account_setting_default.this will be created
  + resource "aws_ecs_account_setting_default" "this" {
      + id            = (known after apply)
      + name          = "taskLongArnFormat"
      + principal_arn = (known after apply)
      + value         = "enabled"
    }

  # module.ecs.aws_ecs_cluster.this will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "default"
      + tags_all = {
          + "Name"        = "infra"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }

      + configuration {
          + execute_command_configuration {
              + kms_key_id = (known after apply)
              + logging    = "OVERRIDE"

              + log_configuration {
                  + cloud_watch_encryption_enabled = true
                  + cloud_watch_log_group_name     = "/aws/ecs/cluster/default"
                }
            }
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs.aws_ecs_cluster_capacity_providers.this will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + cluster_name = "default"
      + id           = (known after apply)
    }

  # module.http_https_everywhere.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "http and https everywhere group managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "http and https everywhere"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Name"        = "infra"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id                 = "vpc-09289eb9291b2949c"
    }

  # module.http_https_everywhere.aws_security_group_rule.egress will be created
  + resource "aws_security_group_rule" "egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "All egress traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.http_https_everywhere.aws_security_group_rule.tcp[0] will be created
  + resource "aws_security_group_rule" "tcp" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 80
      + type                     = "ingress"
    }

  # module.http_https_everywhere.aws_security_group_rule.tcp[1] will be created
  + resource "aws_security_group_rule" "tcp" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.jelliott_records.aws_route53_record.this[" NS"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "jelliott.io"
      + records         = [
          + "ns-1201.awsdns-22.org.",
          + "ns-1555.awsdns-02.co.uk.",
          + "ns-8.awsdns-01.com.",
          + "ns-901.awsdns-48.net.",
        ]
      + ttl             = 172800
      + type            = "NS"
      + zone_id         = "Z04938253L3MEH8G7WE6R"
    }

  # module.jelliott_records.aws_route53_record.this["jenkins A"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "jenkins.jelliott.io"
      + records         = [
          + "192.168.1.130",
        ]
      + ttl             = 120
      + type            = "A"
      + zone_id         = "Z04938253L3MEH8G7WE6R"
    }

  # module.registry.null_resource.apigateway_create_deployment will be destroyed
  # (because null_resource.apigateway_create_deployment is not in configuration)
  - resource "null_resource" "apigateway_create_deployment" {
      - id = "1870206316084463404" -> null
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Name" = "capnduck-default"
        }
      + tags_all               = {
          + "Name"        = "capnduck-default"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Name" = "capnduck-default"
        }
      + tags_all               = {
          + "Name"        = "capnduck-default"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "capnduck-default"
        }
      + tags_all               = {
          + "Name"        = "capnduck-default"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "capnduck"
        }
      + tags_all = {
          + "Name"        = "capnduck"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "capnduck-private-us-west-2a"
        }
      + tags_all         = {
          + "Name"        = "capnduck-private-us-west-2a"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "capnduck-private-us-west-2b"
        }
      + tags_all         = {
          + "Name"        = "capnduck-private-us-west-2b"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "capnduck-private-us-west-2c"
        }
      + tags_all         = {
          + "Name"        = "capnduck-private-us-west-2c"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[3] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "capnduck-private-us-west-2d"
        }
      + tags_all         = {
          + "Name"        = "capnduck-private-us-west-2d"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[4] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "capnduck-private-us-west-2a"
        }
      + tags_all         = {
          + "Name"        = "capnduck-private-us-west-2a"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[5] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "capnduck-private-us-west-2b"
        }
      + tags_all         = {
          + "Name"        = "capnduck-private-us-west-2b"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "capnduck-public"
        }
      + tags_all         = {
          + "Name"        = "capnduck-public"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[3] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[4] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[5] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.128.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "capnduck-private-us-west-2a"
        }
      + tags_all                                       = {
          + "Name"        = "capnduck-private-us-west-2a"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.144.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "capnduck-private-us-west-2b"
        }
      + tags_all                                       = {
          + "Name"        = "capnduck-private-us-west-2b"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.160.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "capnduck-private-us-west-2c"
        }
      + tags_all                                       = {
          + "Name"        = "capnduck-private-us-west-2c"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[3] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2d"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.176.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "capnduck-private-us-west-2d"
        }
      + tags_all                                       = {
          + "Name"        = "capnduck-private-us-west-2d"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[4] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.192.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "capnduck-private-us-west-2a"
        }
      + tags_all                                       = {
          + "Name"        = "capnduck-private-us-west-2a"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[5] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.208.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "capnduck-private-us-west-2b"
        }
      + tags_all                                       = {
          + "Name"        = "capnduck-private-us-west-2b"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "capnduck-public-us-west-2a"
        }
      + tags_all                                       = {
          + "Name"        = "capnduck-public-us-west-2a"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "capnduck-public-us-west-2b"
        }
      + tags_all                                       = {
          + "Name"        = "capnduck-public-us-west-2b"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "capnduck-public-us-west-2c"
        }
      + tags_all                                       = {
          + "Name"        = "capnduck-public-us-west-2c"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "capnduck"
        }
      + tags_all                             = {
          + "Name"        = "capnduck"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
    }

  # module.zones.aws_route53_zone.this["jelliott.io"] will be created
  + resource "aws_route53_zone" "this" {
      + arn                 = (known after apply)
      + comment             = "jelliott (dot) io"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "jelliott.io"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "Name" = "jelliott.io"
        }
      + tags_all            = {
          + "Name"        = "jelliott.io"
          + "environment" = "prod"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
      + zone_id             = (known after apply)
    }

  # module.ecs.module.kms.aws_kms_alias.this will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/capnduck-ecs-key"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.ecs.module.kms.aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 14
      + description                        = "This key is used to encrypt and decrypt objects."
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = false
      + policy                             = (known after apply)
      + tags                               = {
          + "module" = "aws_kms_key"
        }
      + tags_all                           = {
          + "Name"        = "infra"
          + "environment" = "prod"
          + "module"      = "aws_kms_key"
          + "owner"       = "aws@capnduck.com"
          + "project"     = "infrastructure"
          + "terraform"   = "true"
        }
    }

  # module.registry.module.authorizer.aws_iam_role.authorizer will be destroyed
  # (because aws_iam_role.authorizer is not in configuration)
  - resource "aws_iam_role" "authorizer" {
      - arn                   = "arn:aws:iam::009727205366:role/lambda-lambdaRole-waf" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-04-09T19:02:43Z" -> null
      - force_detach_policies = false -> null
      - id                    = "lambda-lambdaRole-waf" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "lambda-lambdaRole-waf" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAQEQ6JL73P5AYZ3SOX" -> null

      - inline_policy {
          - name   = "authorizer" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "secretsmanager:List*",
                              - "secretsmanager:Get*",
                              - "secretsmanager:Describe*",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:secretsmanager:us-west-2:009727205366:secret:capnduck.com-prod-gGA6eW"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.registry.module.authorizer.aws_lambda_function.authorizer will be destroyed
  # (because aws_lambda_function.authorizer is not in configuration)
  - resource "aws_lambda_function" "authorizer" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:us-west-2:009727205366:function:registry-prod-authorizer" -> null
      - filename                       = ".terraform/modules/registry/modules/registry-authorizer/authorizer_package.zip" -> null
      - function_name                  = "registry-prod-authorizer" -> null
      - handler                        = "authorizer.lambda_handler" -> null
      - id                             = "registry-prod-authorizer" -> null
      - invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:009727205366:function:registry-prod-authorizer/invocations" -> null
      - last_modified                  = "2024-04-09T19:02:50.660+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 128 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:us-west-2:009727205366:function:registry-prod-authorizer:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:009727205366:function:registry-prod-authorizer:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::009727205366:role/lambda-lambdaRole-waf" -> null
      - runtime                        = "python3.9" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "RmfevxhPFo0lXjYbGZxTHwfowKdmGztkaGXQyok7Wg8=" -> null
      - source_code_size               = 85064 -> null
      - tags                           = {
          - "Name"             = "registry-prod-authorizer"
          - "Product"          = "terraform registry"
          - "ProductComponent" = "terraform"
        } -> null
      - tags_all                       = {
          - "Name"             = "registry-prod-authorizer"
          - "Product"          = "terraform registry"
          - "ProductComponent" = "terraform"
        } -> null
      - timeout                        = 10 -> null
      - version                        = "$LATEST" -> null

      - environment {
          - variables = {
              - "SECRET_KEY_NAME" = "capnduck.com-prod"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format = "Text" -> null
          - log_group  = "/aws/lambda/registry-prod-authorizer" -> null
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.registry.module.jwt.aws_secretsmanager_secret.secret will be destroyed
  # (because aws_secretsmanager_secret.secret is not in configuration)
  - resource "aws_secretsmanager_secret" "secret" {
      - arn                            = "arn:aws:secretsmanager:us-west-2:009727205366:secret:capnduck.com-prod-gGA6eW" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:us-west-2:009727205366:secret:capnduck.com-prod-gGA6eW" -> null
      - kms_key_id                     = "1dc6d2e5-eca1-4ede-9a6d-6949dea5a70b" -> null
      - name                           = "capnduck.com-prod" -> null
      - recovery_window_in_days        = 30 -> null
      - tags                           = {
          - "Name"             = "capnduck.com-prod"
          - "Product"          = "terraform registry"
          - "ProductComponent" = "terraform"
        } -> null
      - tags_all                       = {
          - "Name"             = "capnduck.com-prod"
          - "Product"          = "terraform registry"
          - "ProductComponent" = "terraform"
        } -> null
    }

  # module.registry.module.jwt.aws_secretsmanager_secret_version.secret will be destroyed
  # (because aws_secretsmanager_secret_version.secret is not in configuration)
  - resource "aws_secretsmanager_secret_version" "secret" {
      - arn            = "arn:aws:secretsmanager:us-west-2:009727205366:secret:capnduck.com-prod-gGA6eW" -> null
      - id             = "arn:aws:secretsmanager:us-west-2:009727205366:secret:capnduck.com-prod-gGA6eW|terraform-20240409190243391200000002" -> null
      - secret_id      = "arn:aws:secretsmanager:us-west-2:009727205366:secret:capnduck.com-prod-gGA6eW" -> null
      - secret_string  = (sensitive value) -> null
      - version_id     = "terraform-20240409190243391200000002" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # module.registry.module.jwt.random_password.secret will be destroyed
  # (because random_password.secret is not in configuration)
  - resource "random_password" "secret" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 256 -> null
      - lower       = true -> null
      - min_lower   = 16 -> null
      - min_numeric = 16 -> null
      - min_special = 0 -> null
      - min_upper   = 16 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.registry.module.registry.aws_api_gateway_authorizer.main[0] will be destroyed
  # (because aws_api_gateway_authorizer.main is not in configuration)
  - resource "aws_api_gateway_authorizer" "main" {
      - arn                              = "arn:aws:apigateway:us-west-2::/restapis/5woxtrwobi/authorizers/bwi832" -> null
      - authorizer_credentials           = "arn:aws:iam::009727205366:role/registry-prod-authorizer" -> null
      - authorizer_result_ttl_in_seconds = 300 -> null
      - authorizer_uri                   = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:009727205366:function:registry-prod-authorizer/invocations" -> null
      - id                               = "bwi832" -> null
      - identity_source                  = "method.request.header.Authorization" -> null
      - name                             = "custom" -> null
      - provider_arns                    = [] -> null
      - rest_api_id                      = "5woxtrwobi" -> null
      - type                             = "TOKEN" -> null
    }

  # module.registry.module.registry.aws_api_gateway_base_path_mapping.main[0] will be destroyed
  # (because aws_api_gateway_base_path_mapping.main is not in configuration)
  - resource "aws_api_gateway_base_path_mapping" "main" {
      - api_id      = "5woxtrwobi" -> null
      - domain_name = "registry.capnduck.com" -> null
      - id          = "registry.capnduck.com/" -> null
      - stage_name  = "live" -> null
    }

  # module.registry.module.registry.aws_api_gateway_domain_name.main[0] will be destroyed
  # (because aws_api_gateway_domain_name.main is not in configuration)
  - resource "aws_api_gateway_domain_name" "main" {
      - arn                      = "arn:aws:apigateway:us-west-2::/domainnames/registry.capnduck.com" -> null
      - certificate_upload_date  = "2024-04-09T19:02:58Z" -> null
      - cloudfront_zone_id       = "Z2FDTNDATAQYW2" -> null
      - domain_name              = "registry.capnduck.com" -> null
      - id                       = "registry.capnduck.com" -> null
      - regional_certificate_arn = "arn:aws:acm:us-west-2:009727205366:certificate/3317431d-4b19-4c60-b137-af91a43c9540" -> null
      - regional_domain_name     = "d-1gmcfibcx0.execute-api.us-west-2.amazonaws.com" -> null
      - regional_zone_id         = "Z2OJLYMUO9EFXC" -> null
      - security_policy          = "TLS_1_2" -> null
      - tags                     = {
          - "Product"          = "terraform registry"
          - "ProductComponent" = "terraform"
        } -> null
      - tags_all                 = {
          - "Product"          = "terraform registry"
          - "ProductComponent" = "terraform"
        } -> null

      - endpoint_configuration {
          - types = [
              - "REGIONAL",
            ] -> null
        }
    }

  # module.registry.module.registry.aws_api_gateway_rest_api.root will be destroyed
  # (because aws_api_gateway_rest_api.root is not in configuration)
  - resource "aws_api_gateway_rest_api" "root" {
      - api_key_source               = "HEADER" -> null
      - arn                          = "arn:aws:apigateway:us-west-2::/restapis/5woxtrwobi" -> null
      - binary_media_types           = [] -> null
      - created_date                 = "2024-04-09T19:02:56Z" -> null
      - disable_execute_api_endpoint = false -> null
      - execution_arn                = "arn:aws:execute-api:us-west-2:009727205366:5woxtrwobi" -> null
      - id                           = "5woxtrwobi" -> null
      - name                         = "registry-prod" -> null
      - root_resource_id             = "1k8d3zfpfa" -> null
      - tags                         = {
          - "Name"             = "registry-prod"
          - "Product"          = "terraform registry"
          - "ProductComponent" = "terraform"
        } -> null
      - tags_all                     = {
          - "Name"             = "registry-prod"
          - "Product"          = "terraform registry"
          - "ProductComponent" = "terraform"
        } -> null

      - endpoint_configuration {
          - types            = [
              - "EDGE",
            ] -> null
          - vpc_endpoint_ids = [] -> null
        }
    }

  # module.registry.module.registry.aws_iam_role.auth[0] will be destroyed
  # (because aws_iam_role.auth is not in configuration)
  - resource "aws_iam_role" "auth" {
      - arn                   = "arn:aws:iam::009727205366:role/registry-prod-authorizer" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "apigateway.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-04-09T19:02:56Z" -> null
      - force_detach_policies = false -> null
      - id                    = "registry-prod-authorizer" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "registry-prod-authorizer" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAQEQ6JL73JPARJS4WZ" -> null

      - inline_policy {
          - name   = "terraform-20240409190256564400000003" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "lambda:InvokeFunction"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:lambda:us-west-2:009727205366:function:registry-prod-authorizer"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.registry.module.registry.aws_iam_role.modules will be destroyed
  # (because aws_iam_role.modules is not in configuration)
  - resource "aws_iam_role" "modules" {
      - arn                   = "arn:aws:iam::009727205366:role/registry-prod-modules" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "apigateway.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-04-09T19:02:56Z" -> null
      - force_detach_policies = false -> null
      - id                    = "registry-prod-modules" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "registry-prod-modules" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAQEQ6JL73HUCS6DN7R" -> null

      - inline_policy {
          - name   = "terraform-20240409190256613100000004" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "dynamodb:Query",
                              - "dynamodb:GetItem",
                              - "dynamodb:BatchGetItem",
                              - "dynamodb:GetRecords",
                              - "dynamodb:Scan",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:dynamodb:us-west-2:009727205366:table/capnduck.com-terraform-registry",
                            ]
                        },
                      - {
                          - Action   = [
                              - "s3:Get*",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::capnduck.com-terraform-registry",
                              - "arn:aws:s3:::capnduck.com-terraform-registry/*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.registry.module.registry.aws_iam_role_policy.auth[0] will be destroyed
  # (because aws_iam_role_policy.auth is not in configuration)
  - resource "aws_iam_role_policy" "auth" {
      - id          = "registry-prod-authorizer:terraform-20240409190256564400000003" -> null
      - name        = "terraform-20240409190256564400000003" -> null
      - name_prefix = "terraform-" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:us-west-2:009727205366:function:registry-prod-authorizer"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "registry-prod-authorizer" -> null
    }

  # module.registry.module.registry.aws_iam_role_policy.modules will be destroyed
  # (because aws_iam_role_policy.modules is not in configuration)
  - resource "aws_iam_role_policy" "modules" {
      - id          = "registry-prod-modules:terraform-20240409190256613100000004" -> null
      - name        = "terraform-20240409190256613100000004" -> null
      - name_prefix = "terraform-" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:BatchGetItem",
                          - "dynamodb:GetRecords",
                          - "dynamodb:Scan",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:us-west-2:009727205366:table/capnduck.com-terraform-registry",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:Get*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::capnduck.com-terraform-registry",
                          - "arn:aws:s3:::capnduck.com-terraform-registry/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "registry-prod-modules" -> null
    }

  # module.registry.module.store.aws_dynamodb_table.modules will be destroyed
  # (because aws_dynamodb_table.modules is not in configuration)
  - resource "aws_dynamodb_table" "modules" {
      - arn                         = "arn:aws:dynamodb:us-west-2:009727205366:table/capnduck.com-terraform-registry" -> null
      - billing_mode                = "PROVISIONED" -> null
      - deletion_protection_enabled = false -> null
      - hash_key                    = "Id" -> null
      - id                          = "capnduck.com-terraform-registry" -> null
      - name                        = "capnduck.com-terraform-registry" -> null
      - range_key                   = "Version" -> null
      - read_capacity               = 5 -> null
      - stream_enabled              = false -> null
      - table_class                 = "STANDARD" -> null
      - tags                        = {
          - "Name"             = "capnduck.com-terraform-registry"
          - "Product"          = "terraform registry"
          - "ProductComponent" = "terraform"
        } -> null
      - tags_all                    = {
          - "Name"             = "capnduck.com-terraform-registry"
          - "Product"          = "terraform registry"
          - "ProductComponent" = "terraform"
        } -> null
      - write_capacity              = 1 -> null

      - attribute {
          - name = "Id" -> null
          - type = "S" -> null
        }
      - attribute {
          - name = "Version" -> null
          - type = "S" -> null
        }

      - point_in_time_recovery {
          - enabled = false -> null
        }

      - ttl {
          - enabled = false -> null
        }
    }

  # module.registry.module.store.aws_s3_bucket.bucket will be destroyed
  # (because aws_s3_bucket.bucket is not in configuration)
  - resource "aws_s3_bucket" "bucket" {
      - arn                         = "arn:aws:s3:::capnduck.com-terraform-registry" -> null
      - bucket                      = "capnduck.com-terraform-registry" -> null
      - bucket_domain_name          = "capnduck.com-terraform-registry.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "capnduck.com-terraform-registry.s3.us-west-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3BJ6K6RIION7M" -> null
      - id                          = "capnduck.com-terraform-registry" -> null
      - object_lock_enabled         = false -> null
      - region                      = "us-west-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Name"             = "capnduck.com-terraform-registry"
          - "Product"          = "terraform registry"
          - "ProductComponent" = "terraform"
        } -> null
      - tags_all                    = {
          - "Name"             = "capnduck.com-terraform-registry"
          - "Product"          = "terraform registry"
          - "ProductComponent" = "terraform"
        } -> null

      - grant {
          - id          = "0c94ba8c7fdd491d2c9b92c1c77161b32a133b21f0e97d5616b53e7b687a09f0" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.registry.module.store.aws_s3_bucket_acl.bucket will be destroyed
  # (because aws_s3_bucket_acl.bucket is not in configuration)
  - resource "aws_s3_bucket_acl" "bucket" {
      - acl    = "private" -> null
      - bucket = "capnduck.com-terraform-registry" -> null
      - id     = "capnduck.com-terraform-registry,private" -> null

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name = "ec2" -> null
                  - id           = "0c94ba8c7fdd491d2c9b92c1c77161b32a133b21f0e97d5616b53e7b687a09f0" -> null
                  - type         = "CanonicalUser" -> null
                }
            }
          - owner {
              - display_name = "ec2" -> null
              - id           = "0c94ba8c7fdd491d2c9b92c1c77161b32a133b21f0e97d5616b53e7b687a09f0" -> null
            }
        }
    }

  # module.registry.module.store.aws_s3_bucket_ownership_controls.bucket will be destroyed
  # (because aws_s3_bucket_ownership_controls.bucket is not in configuration)
  - resource "aws_s3_bucket_ownership_controls" "bucket" {
      - bucket = "capnduck.com-terraform-registry" -> null
      - id     = "capnduck.com-terraform-registry" -> null

      - rule {
          - object_ownership = "BucketOwnerPreferred" -> null
        }
    }

  # module.registry.module.store.aws_s3_bucket_versioning.bucket will be destroyed
  # (because aws_s3_bucket_versioning.bucket is not in configuration)
  - resource "aws_s3_bucket_versioning" "bucket" {
      - bucket = "capnduck.com-terraform-registry" -> null
      - id     = "capnduck.com-terraform-registry" -> null

      - versioning_configuration {
          - status = "Enabled" -> null
        }
    }

  # module.registry.module.registry.module.disco.aws_api_gateway_integration.well_known_terraform_GET will be destroyed
  # (because aws_api_gateway_integration.well_known_terraform_GET is not in configuration)
  - resource "aws_api_gateway_integration" "well_known_terraform_GET" {
      - cache_key_parameters = [] -> null
      - cache_namespace      = "jhkbsu" -> null
      - connection_type      = "INTERNET" -> null
      - http_method          = "GET" -> null
      - id                   = "agi-5woxtrwobi-jhkbsu-GET" -> null
      - passthrough_behavior = "WHEN_NO_MATCH" -> null
      - request_parameters   = {} -> null
      - request_templates    = {
          - "application/json" = jsonencode(
                {
                  - statusCode = 200
                }
            )
        } -> null
      - resource_id          = "jhkbsu" -> null
      - rest_api_id          = "5woxtrwobi" -> null
      - timeout_milliseconds = 29000 -> null
      - type                 = "MOCK" -> null
    }

  # module.registry.module.registry.module.disco.aws_api_gateway_integration_response.well_known_terraform_GET_200 will be destroyed
  # (because aws_api_gateway_integration_response.well_known_terraform_GET_200 is not in configuration)
  - resource "aws_api_gateway_integration_response" "well_known_terraform_GET_200" {
      - http_method         = "GET" -> null
      - id                  = "agir-5woxtrwobi-jhkbsu-GET-200" -> null
      - resource_id         = "jhkbsu" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = jsonencode(
                {
                  - "modules.v1" = "/modules.v1/"
                }
            )
        } -> null
      - rest_api_id         = "5woxtrwobi" -> null
      - status_code         = "200" -> null
    }

  # module.registry.module.registry.module.disco.aws_api_gateway_method.well_known_terraform_GET will be destroyed
  # (because aws_api_gateway_method.well_known_terraform_GET is not in configuration)
  - resource "aws_api_gateway_method" "well_known_terraform_GET" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "GET" -> null
      - id                   = "agm-5woxtrwobi-jhkbsu-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "jhkbsu" -> null
      - rest_api_id          = "5woxtrwobi" -> null
    }

  # module.registry.module.registry.module.disco.aws_api_gateway_method_response.well_known_terraform_GET_200 will be destroyed
  # (because aws_api_gateway_method_response.well_known_terraform_GET_200 is not in configuration)
  - resource "aws_api_gateway_method_response" "well_known_terraform_GET_200" {
      - http_method         = "GET" -> null
      - id                  = "agmr-5woxtrwobi-jhkbsu-GET-200" -> null
      - resource_id         = "jhkbsu" -> null
      - response_models     = {} -> null
      - response_parameters = {} -> null
      - rest_api_id         = "5woxtrwobi" -> null
      - status_code         = "200" -> null
    }

  # module.registry.module.registry.module.disco.aws_api_gateway_resource.well_known will be destroyed
  # (because aws_api_gateway_resource.well_known is not in configuration)
  - resource "aws_api_gateway_resource" "well_known" {
      - id          = "h3di0d" -> null
      - parent_id   = "1k8d3zfpfa" -> null
      - path        = "/.well-known" -> null
      - path_part   = ".well-known" -> null
      - rest_api_id = "5woxtrwobi" -> null
    }

  # module.registry.module.registry.module.disco.aws_api_gateway_resource.well_known_terraform will be destroyed
  # (because aws_api_gateway_resource.well_known_terraform is not in configuration)
  - resource "aws_api_gateway_resource" "well_known_terraform" {
      - id          = "jhkbsu" -> null
      - parent_id   = "h3di0d" -> null
      - path        = "/.well-known/terraform.json" -> null
      - path_part   = "terraform.json" -> null
      - rest_api_id = "5woxtrwobi" -> null
    }

  # module.registry.module.registry.module.modules_v1.aws_api_gateway_integration.download_GET will be destroyed
  # (because aws_api_gateway_integration.download_GET is not in configuration)
  - resource "aws_api_gateway_integration" "download_GET" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "d5bynn" -> null
      - connection_type         = "INTERNET" -> null
      - credentials             = "arn:aws:iam::009727205366:role/registry-prod-modules" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-5woxtrwobi-d5bynn-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {
          - "application/json" = jsonencode(
                {
                  - Key       = {
                      - Id      = {
                          - S = "$util.urlEncode($input.params('namespace'))/$util.urlEncode($input.params('module'))/$util.urlEncode($input.params('provider'))"
                        }
                      - Version = {
                          - S = "$util.urlEncode($input.params('version'))"
                        }
                    }
                  - TableName = "capnduck.com-terraform-registry"
                }
            )
        } -> null
      - resource_id             = "d5bynn" -> null
      - rest_api_id             = "5woxtrwobi" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:dynamodb:action/GetItem" -> null
    }

  # module.registry.module.registry.module.modules_v1.aws_api_gateway_integration.versions_GET will be destroyed
  # (because aws_api_gateway_integration.versions_GET is not in configuration)
  - resource "aws_api_gateway_integration" "versions_GET" {
      - cache_key_parameters    = [] -> null
      - cache_namespace         = "mietgk" -> null
      - connection_type         = "INTERNET" -> null
      - credentials             = "arn:aws:iam::009727205366:role/registry-prod-modules" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-5woxtrwobi-mietgk-GET" -> null
      - integration_http_method = "POST" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {} -> null
      - request_templates       = {
          - "application/json" = jsonencode(
                {
                  - ExpressionAttributeValues = {
                      - ":v1" = {
                          - S = "$util.urlEncode($input.params('namespace'))/$util.urlEncode($input.params('module'))/$util.urlEncode($input.params('provider'))"
                        }
                    }
                  - KeyConditionExpression    = "Id = :v1"
                  - ScanIndexForward          = false
                  - TableName                 = "capnduck.com-terraform-registry"
                }
            )
        } -> null
      - resource_id             = "mietgk" -> null
      - rest_api_id             = "5woxtrwobi" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS" -> null
      - uri                     = "arn:aws:apigateway:us-west-2:dynamodb:action/Query" -> null
    }

  # module.registry.module.registry.module.modules_v1.aws_api_gateway_integration_response.download_GET_200 will be destroyed
  # (because aws_api_gateway_integration_response.download_GET_200 is not in configuration)
  - resource "aws_api_gateway_integration_response" "download_GET_200" {
      - http_method         = "GET" -> null
      - id                  = "agir-5woxtrwobi-d5bynn-GET-200" -> null
      - resource_id         = "d5bynn" -> null
      - response_parameters = {
          - "method.response.header.X-Terraform-Get" = "integration.response.body.Item.Source.S"
        } -> null
      - response_templates  = {
          - "application/json" = <<-EOT
                #set($inputRoot = $input.path('$'))
                {
                  "version": "$util.escapeJavaScript($inputRoot.Item.Version.S)",
                  "source": "$util.escapeJavaScript($inputRoot.Item.Source.S)",
                }
            EOT
        } -> null
      - rest_api_id         = "5woxtrwobi" -> null
      - status_code         = "200" -> null
    }

  # module.registry.module.registry.module.modules_v1.aws_api_gateway_integration_response.versions_GET_200 will be destroyed
  # (because aws_api_gateway_integration_response.versions_GET_200 is not in configuration)
  - resource "aws_api_gateway_integration_response" "versions_GET_200" {
      - http_method         = "GET" -> null
      - id                  = "agir-5woxtrwobi-mietgk-GET-200" -> null
      - resource_id         = "mietgk" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = <<-EOT
                #set($inputRoot = $input.path('$'))
                {
                    "modules": [
                        {
                            "versions": [
                                #foreach($elem in $inputRoot.Items){"version": "$util.escapeJavaScript($elem.Version.S)"}#if($foreach.hasNext),#end#end
                            ]
                        }
                    ]
                }
            EOT
        } -> null
      - rest_api_id         = "5woxtrwobi" -> null
      - status_code         = "200" -> null
    }

  # module.registry.module.registry.module.modules_v1.aws_api_gateway_method.download_GET will be destroyed
  # (because aws_api_gateway_method.download_GET is not in configuration)
  - resource "aws_api_gateway_method" "download_GET" {
      - api_key_required     = false -> null
      - authorization        = "CUSTOM" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "bwi832" -> null
      - http_method          = "GET" -> null
      - id                   = "agm-5woxtrwobi-d5bynn-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "d5bynn" -> null
      - rest_api_id          = "5woxtrwobi" -> null
    }

  # module.registry.module.registry.module.modules_v1.aws_api_gateway_method.versions_GET will be destroyed
  # (because aws_api_gateway_method.versions_GET is not in configuration)
  - resource "aws_api_gateway_method" "versions_GET" {
      - api_key_required     = false -> null
      - authorization        = "CUSTOM" -> null
      - authorization_scopes = [] -> null
      - authorizer_id        = "bwi832" -> null
      - http_method          = "GET" -> null
      - id                   = "agm-5woxtrwobi-mietgk-GET" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "mietgk" -> null
      - rest_api_id          = "5woxtrwobi" -> null
    }

  # module.registry.module.registry.module.modules_v1.aws_api_gateway_method_response.download_GET_200 will be destroyed
  # (because aws_api_gateway_method_response.download_GET_200 is not in configuration)
  - resource "aws_api_gateway_method_response" "download_GET_200" {
      - http_method         = "GET" -> null
      - id                  = "agmr-5woxtrwobi-d5bynn-GET-200" -> null
      - resource_id         = "d5bynn" -> null
      - response_models     = {} -> null
      - response_parameters = {
          - "method.response.header.X-Terraform-Get" = true
        } -> null
      - rest_api_id         = "5woxtrwobi" -> null
      - status_code         = "200" -> null
    }

  # module.registry.module.registry.module.modules_v1.aws_api_gateway_method_response.versions_GET_200 will be destroyed
  # (because aws_api_gateway_method_response.versions_GET_200 is not in configuration)
  - resource "aws_api_gateway_method_response" "versions_GET_200" {
      - http_method         = "GET" -> null
      - id                  = "agmr-5woxtrwobi-mietgk-GET-200" -> null
      - resource_id         = "mietgk" -> null
      - response_models     = {} -> null
      - response_parameters = {} -> null
      - rest_api_id         = "5woxtrwobi" -> null
      - status_code         = "200" -> null
    }

  # module.registry.module.registry.module.modules_v1.aws_api_gateway_resource.download will be destroyed
  # (because aws_api_gateway_resource.download is not in configuration)
  - resource "aws_api_gateway_resource" "download" {
      - id          = "d5bynn" -> null
      - parent_id   = "6n7ozm" -> null
      - path        = "/modules.v1/{namespace}/{module}/{provider}/{version}/download" -> null
      - path_part   = "download" -> null
      - rest_api_id = "5woxtrwobi" -> null
    }

  # module.registry.module.registry.module.modules_v1.aws_api_gateway_resource.module will be destroyed
  # (because aws_api_gateway_resource.module is not in configuration)
  - resource "aws_api_gateway_resource" "module" {
      - id          = "nevl7e" -> null
      - parent_id   = "t0vetm" -> null
      - path        = "/modules.v1/{namespace}/{module}" -> null
      - path_part   = "{module}" -> null
      - rest_api_id = "5woxtrwobi" -> null
    }

  # module.registry.module.registry.module.modules_v1.aws_api_gateway_resource.modules_root will be destroyed
  # (because aws_api_gateway_resource.modules_root is not in configuration)
  - resource "aws_api_gateway_resource" "modules_root" {
      - id          = "ol48ui" -> null
      - parent_id   = "1k8d3zfpfa" -> null
      - path        = "/modules.v1" -> null
      - path_part   = "modules.v1" -> null
      - rest_api_id = "5woxtrwobi" -> null
    }

  # module.registry.module.registry.module.modules_v1.aws_api_gateway_resource.namespace will be destroyed
  # (because aws_api_gateway_resource.namespace is not in configuration)
  - resource "aws_api_gateway_resource" "namespace" {
      - id          = "t0vetm" -> null
      - parent_id   = "ol48ui" -> null
      - path        = "/modules.v1/{namespace}" -> null
      - path_part   = "{namespace}" -> null
      - rest_api_id = "5woxtrwobi" -> null
    }

  # module.registry.module.registry.module.modules_v1.aws_api_gateway_resource.provider will be destroyed
  # (because aws_api_gateway_resource.provider is not in configuration)
  - resource "aws_api_gateway_resource" "provider" {
      - id          = "ezpxbi" -> null
      - parent_id   = "nevl7e" -> null
      - path        = "/modules.v1/{namespace}/{module}/{provider}" -> null
      - path_part   = "{provider}" -> null
      - rest_api_id = "5woxtrwobi" -> null
    }

  # module.registry.module.registry.module.modules_v1.aws_api_gateway_resource.version will be destroyed
  # (because aws_api_gateway_resource.version is not in configuration)
  - resource "aws_api_gateway_resource" "version" {
      - id          = "6n7ozm" -> null
      - parent_id   = "ezpxbi" -> null
      - path        = "/modules.v1/{namespace}/{module}/{provider}/{version}" -> null
      - path_part   = "{version}" -> null
      - rest_api_id = "5woxtrwobi" -> null
    }

  # module.registry.module.registry.module.modules_v1.aws_api_gateway_resource.versions will be destroyed
  # (because aws_api_gateway_resource.versions is not in configuration)
  - resource "aws_api_gateway_resource" "versions" {
      - id          = "mietgk" -> null
      - parent_id   = "ezpxbi" -> null
      - path        = "/modules.v1/{namespace}/{module}/{provider}/versions" -> null
      - path_part   = "versions" -> null
      - rest_api_id = "5woxtrwobi" -> null
    }

Plan: 1 to import, 77 to add, 1 to change, 44 to destroy.

Changes to Outputs:
  + account_id                = "009727205366"
  + acm_arn                   = (known after apply)
  + aws_vpc_id                = "vpc-09289eb9291b2949c"
  - bucket_name               = "capnduck.com-terraform-registry" -> null
  + distinct_domain_names     = [
      + "capnduck.com",
      + "www.capnduck.com",
    ]
  - dns_alias                 = {
      - hostname        = "d-1gmcfibcx0.execute-api.us-west-2.amazonaws.com"
      - route53_zone_id = "Z2OJLYMUO9EFXC"
    } -> null
  + ds                        = (known after apply)
  - dynamodb_table_arn        = "arn:aws:dynamodb:us-west-2:009727205366:table/capnduck.com-terraform-registry" -> null
  - dynamodb_table_name       = "capnduck.com-terraform-registry" -> null
  + myip                      = "207.224.118.130"
  + private                   = [
      + "subnet-0c035011e361ea452",
      + "subnet-04a38528da1dcb2ed",
      + "subnet-0f6f3efb89a553c06",
      + "subnet-06f85801b091e2759",
      + "subnet-06947ef14298c9e67",
      + "subnet-0253184dc60aaf031",
    ]
  + public                    = [
      + "subnet-0a284c52e2f9146f9",
      + "subnet-0a5bc5ec073940dca",
      + "subnet-0b94d7faf68936e3c",
    ]
  - registry_secret_key_name  = "capnduck.com-prod" -> null
  - rest_api_id               = "5woxtrwobi" -> null
  - rest_api_stage_name       = "live" -> null
  + route53_zone              = [
      + {
          + arn                        = "arn:aws:route53:::hostedzone/Z05346383CF9J3IH2UIOG"
          + caller_reference           = "8578c293-9bbf-4017-ac5b-6ac3e1040d92"
          + comment                    = "Managed by Terraform"
          + id                         = "Z05346383CF9J3IH2UIOG"
          + linked_service_description = null
          + linked_service_principal   = null
          + name                       = "capnduck.com"
          + name_servers               = [
              + "ns-157.awsdns-19.com",
              + "ns-755.awsdns-30.net",
              + "ns-1705.awsdns-21.co.uk",
              + "ns-1348.awsdns-40.org",
            ]
          + primary_name_server        = "ns-157.awsdns-19.com"
          + private_zone               = false
          + resource_record_set_count  = 21
          + tags                       = {
              + Name        = "capnduck.com."
              + environment = "prod"
              + owner       = "aws@capnduck.com"
              + project     = "infrastructure"
              + terraform   = "true"
            }
          + vpc_id                     = null
          + zone_id                    = "Z05346383CF9J3IH2UIOG"
        },
    ]
  + route53_zone_name         = {
      + "jelliott.io" = "jelliott.io"
    }
  + route53_zone_name_servers = {
      + "jelliott.io" = (known after apply)
    }
  + route53_zone_zone_id      = {
      + "jelliott.io" = (known after apply)
    }

```

</details>

*Pushed by: @jelliottio, Action: `pull_request`*